### Importing Libraries

In [1]:
import pandas as pd
import numpy as np

### Read The Occupation Data From Link

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep="|", 
                 index_col="user_id")

In [3]:
df.shape

(943, 4)

In [4]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Set The Filter Conditions

In [5]:
filt = (df["occupation"] == "other") & (df["age"] > 45)

### Get The Index of Filterd Rows

In [58]:
target_drop_index = df.loc[filt].index
target_drop_index

Int64Index([  2, 120, 136, 168, 169, 173, 273, 312, 333, 360, 423, 454, 489,
            602, 629, 696, 810, 912],
           dtype='int64', name='user_id')

### Drop The Records That Match Filter

In [59]:
df.drop(target_drop_index, inplace=True)

In [60]:
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[925 rows x 4 columns]